[
"<h3>Space Battle</h3><br><pre>This is a coding game, your task is to code space ship AI that directs your ship to destroy enemies and win the battle.</pre>",
"<h3>Game</h3><br><pre>There are two teams, players are assigned randomly to the teams.\nBattle ends after 1000 rounds or when all ships from at least one team are destroyed.</pre>",
"<h3>World</h3><br><pre>For some “magical” reason, the world is 2d and its size is 100x100 units. </pre>",
"<h3>Ship</h3><br><pre>Each round your ship has 100 points of energy to distribute among shis systems: Engines, Shields, Scanners, Weapons, Repair</pre>",
"<h3>Engines</h3><br><pre>They are used to move ships in a certain direction.\n With current efficiency, the maximum distance that ship can travel in round is 2 units.\n Direction is passed as one of action arguments, and distance is calculated based on assigned energy. </pre>",
"<h3>Weapons</h3><br><pre>Shoots a weapon in a relevant direction. But bear in mind, the maximum range of your weapon is 5 units. If your aim is further, missiles won't reach it. Damage made by the weapon, depends on the amount of energy assigned to the system. </pre>",
"<h3>Shields</h3><br><pre>Very useful in combat, it allows to reduce damage taken by ship by the amount of energy assigned to the shield. </pre>",
"<h3>Scanners</h3><br><pre>Scanners are used to detect items around the ship.\nLow range scanners can detect everything that is in 2 unit range.\nAssigning more power to the scanners can increase this range up to 12 units.</pre>",
"<h3>Repair</h3><br><pre>If you want to repair damage that yout ship took in the battle, assign power to this system</pre>",
"<h3>Language</h3><br><pre>As stated before, your task is to use javascript language to implement AI that directs your ship. \nEvery round, the simulator will execute function execRound and pass to it scanner readings,\nfunction after is being executed returns list of commands that will be executed. </pre>",
"<h3>Readings</h3><br><pre>Fields available in structure passed to execRound  looks like that\nallowedEnergy - numeric maximum amount of energy allowed in this round\nmaximumHitPoints - ship maximum hit points\nhitPoints - ship current hitpoints\nscannerReadings - array of objects in the range of scanners\n\n scanned object - contains fields:\n type - that can have a values   friend, foe, neutral depending on associated team\nposition - contains two fields 'x' and 'y' which are used to represent relative position of the object.</pre>",
"<h3>Actions</h3><br><pre>Example structure\n {\n        \"engines\" : { \"power\": 0, \"direction\": {\"x\": 1.0, \"y\":1.0 } },\n        \"weapons\" : { \"power\": 0, \"direction\": {\"x\": 1.0, \"y\":1.0 } },\n        \"shields\" : { \"power\": 0 },\n        \"scanners\": { \"power\": 0 },\n        \"repair\"  : { \"power\": 0 },\n    }\n</pre>"
]






    
    

